"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы
сотрудника. В расчете необходимо использовать формулу:
(выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""
from sys import argv



try:
    _, hours, hourly_rate, bonus, *_ = argv
    print('Заработная плата составит', int(hours)*int(hourly_rate)+int(bonus))
except ValueError:
    print(f'Вы не верно указали параметры {hours} {hourly_rate} {bonus} '
          f'\nдолжны быть числа: выработка в часах, ставка в час, премия')

