"""
6. Спортсмен занимается ежедневными пробежками.
В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
Требуется определить номер дня, на который общий результат спортсмена
составить не менее b километров.
Программа должна принимать значения параметров a и b и выводить
одно натуральное число — номер дня.
Например: a = 2, b = 3.
Результат:
1-й день: 2
2-й день: 2,2
3-й день: 2,42
4-й день: 2,66
5-й день: 2,93
6-й день: 3,22

Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.
"""
km_from = int(input('Введите со скольки км начинаем: '))
km_to = int(input('Введите сколько км надо достичь: '))

km = km_from
count = 1

while km < km_to:
    km = km + ((km * 10) / 100)
    count += 1


print(f'На {count}-й день спортсмен достигнет результата - не менее {km_to} км.')