"""
4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""

string = input('Введите нескольких слов, разделённых пробелами. \n>>>')

string_lst = string.split(' ')

count = 1
for item in string_lst:
    print(count, item[:10])
    count +=1
