"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

while True:
    month = input('Введите число от 1 до 12 включительно: ')

    seasons = {
        1: 'зима',
        2: 'зима',
        3: 'весна',
        4: 'весна',
        5: 'весна',
        6: 'лето',
        7: 'лето',
        8: 'лето',
        9: 'осень',
        10: 'осень',
        11: 'осень',
        12: 'зима'
        }
    
    if not month.isdigit():
        print('Вы ввели не верное число')
    else:
        if int(month) >= 1 and int(month) <= 12:
            print('Время года:', seasons[int(month)])
        else:
            print('Вы ввели не верное число')
    
