"""
6. * Реализовать структуру данных «Товары».
Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}), 
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]

Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик,
например список названий товаров.

Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""

templates = {
    'название': ('Название товара: ', str),
    'цена': ('Стоимость товара: ', int),
    'количество': ('Введите количество товара: ', int),
    'eд': ('Единицы измерения товара: ', str)
}


count = 1
prod_list =[]

new_enter = True

while new_enter:
    product = {}
    for k, v in templates.items():
        while True:
            try:
                user_value = v[1](input(v[0]))
            except ValueError as e:
                print(f'Вы ввели не верные данные {e}')
                continue
            product[k] = user_value
            break

    prod_list.append((count, product))
    count +=1
    print(prod_list)


    while True:
        new_prod = input('Хотите ввести новый товар? да/нет ')
        if new_prod.lower() in ('да', 'нет'):
            new_enter = new_prod == 'да'
            break
        else:
            print('Вы ввели не верное значение')
            continue


prod_analitics = {}

for k in templates:
    prod_analitics[k] = [item[1][k] for item in prod_list]

print(prod_analitics)
'''
for k in templates:
    result = []
    for item in prod_list:
        result.append(item[1][k])
    prod_analitics[k] = result
'''