"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный
предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и
их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

with open ('task_6.txt', 'r', encoding='utf-8') as file:
    program_dict = {}
    for line in file:
        lst = line.split()
        key = lst[0].rstrip(':')
        total = 0
        for i in range(1, len(lst)):
            if lst[i] == '-':
                continue
            else:
                try:
                    total += int(lst[i])
                except ValueError:
                    print(f'В строке {key}. Ошибка данных: {lst[i]}')
        program_dict[key] = total
    print(program_dict)
