"""
5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел,
то вначале нужно добавить сумму этих чисел к полученной ранее сумме
и после этого завершить программу.
"""
total = 0
while True:
    user_num = input('Введите числа, разделенные пробелом. Для выхода введите \'q\' \n>>>').split()
    loop_break = False

    for d in user_num:
        try:
            total += int(d)
        except ValueError:
            if d.lower() == 'q':
                loop_break = True
                break
            else:
                print(f'Ошибка ввода {d}')
    print('Сумма введеных чисел:', total)
    if loop_break:
        break


