"""
1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
"""
def devision(a,b):
    try:
        return a/b
    except ZeroDivisionError:
        print('Ошибка на ноль делить нельзя')

while True:
    try:
        a = int(input('Введите число'))
        b = int(input('Введите число на которое будем делить'))
        break
    except ValueError:
        print('Ошибка вы ввели не число')

